---
kind: property
id: P:Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.ParamId
source: html/94093d6c-9940-4f8e-1b8d-3270768121cb.htm
---
# Autodesk.Revit.UI.RevisionsOnSheetUIServiceData.ParamId Property

the parameter id

## Syntax (C#)
```csharp
public ElementId ParamId { get; }
```